nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxl255/common/pin_mux/cm33/pin_mux.c
    /* Interrupt configuration on GPIO0_9 (pin B15): Interrupt/DMA request is disabled */
    GPIO_SetPinInterruptChannel(AON__GPIO0, 9U, kGPIO_InterruptOutput0);
    GPIO_SetPinInterruptConfig(AON__GPIO0, 9U, kGPIO_InterruptStatusFlagDisabled);

    /* Interrupt configuration on GPIO1_14 (pin B1): Interrupt/DMA request is disabled */
    GPIO_SetPinInterruptChannel(GPIO1, 14U, kGPIO_InterruptOutput0);
    GPIO_SetPinInterruptConfig(GPIO1, 14U, kGPIO_InterruptStatusFlagDisabled);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitACMPPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: T7, peripheral: ACMP0, signal: 'IN, 0N', pin_signal: P2_22/TRIG_IN15/LPSPI0_SDO/LPI2C1_SDA/LPUART0_RXD/TRIG_OUT5/CT0_MAT0/SLCD_40/WUU_P20/ACMP0_IN0,
    slew_rate: fast, open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low,
    input_buffer: disable, invert_input: normal}
  - {pin_num: T7, peripheral: ACMP0, signal: 'IN, 0P', pin_signal: P2_22/TRIG_IN15/LPSPI0_SDO/LPI2C1_SDA/LPUART0_RXD/TRIG_OUT5/CT0_MAT0/SLCD_40/WUU_P20/ACMP0_IN0,
    slew_rate: fast, open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low,
    input_buffer: disable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitACMPPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitACMPPins(void)
{
    /* Clock gate control PORT2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT2);
    /* ACMP0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kACMP0_RST_SHIFT_RSTn);
    /* PORT2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT2_RST_SHIFT_RSTn);

    const port_pin_config_t port2_22_pinT7_config = {/* Internal pull-up/down resistor is disabled */
                                                     kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     kPORT_LowDriveStrength,
                                                     /* Normal drive strength is configured */
                                                     kPORT_NormalDriveStrength,
                                                     /* Pin is configured as ACMP0_IN0 */
                                                     kPORT_MuxAlt0,
                                                     /* Digital input disabled; it is required for analog functions */
                                                     kPORT_InputBufferDisable,
                                                     /* Digital input is not inverted */
                                                     kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     kPORT_UnlockRegister};
    /* PORT2_22 (pin T7) is configured as ACMP0_IN0 */
    PORT_SetPinConfig(PORT2, 22U, &port2_22_pinT7_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLCDPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: F2, peripheral: AON__SGLCD0_AON, signal: 'P, 15', pin_signal: P1_21/TRIG_IN4/LPUART1_TXD/LPSPI1_PCS1/TRIG_OUT4/CT0_MAT3/SLCD_15, slew_rate: fast, open_drain: disable,
    drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: G2, peripheral: AON__SGLCD0_AON, signal: 'P, 16', pin_signal: P1_22/TRIG_IN5/LPUART1_RTS_B/UTICK_CAP3/TRIG_OUT5/SLCD_16/HSADC0_A17, slew_rate: fast,
    open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: A2, peripheral: AON__SGLCD0_AON, signal: 'P, 6', pin_signal: P1_12/TRIG_IN19/TRIG_OUT2/CT0_MAT2/SLCD_6, slew_rate: fast, open_drain: disable, drive_strength: low,
    pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: A1, peripheral: AON__SGLCD0_AON, signal: 'P, 7', pin_signal: P1_13/TRIG_IN18/LPI2C1_SCL/LPUART0_RTS_B/CT2_MAT0/SLCD_7, slew_rate: fast, open_drain: disable,
    drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low, input_buffer: enable, invert_input: normal}
  - {pin_num: B3, peripheral: AON__SGLCD0_AON, signal: 'P, 48', pin_signal: P1_10/TRIG_IN18/LPI2C0_SCL/UTICK_CAP3/TRIG_OUT6/SLCD_48, slew_rate: fast, open_drain: disable,
    drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low, input_buffer: enable, invert_input: normal}
  - {pin_num: B2, peripheral: AON__SGLCD0_AON, signal: 'P, 49', pin_signal: P1_11/TRIG_IN19/LPI2C0_SDA/TRIG_OUT7/SLCD_49/WUU_P8, slew_rate: fast, open_drain: disable,
    drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low, input_buffer: enable, invert_input: normal}
  - {pin_num: M1, peripheral: AON__SGLCD0_AON, signal: 'P, 22', pin_signal: P2_7/TRIG_IN11/TRIG_OUT3/CT2_MAT2/SLCD_22, slew_rate: fast, open_drain: disable, drive_strength: low,
    pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: U4, peripheral: AON__SGLCD0_AON, signal: 'P, 30', pin_signal: P2_19/SLCD_30, slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down,
    pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: U6, peripheral: AON__SGLCD0_AON, signal: 'P, 31', pin_signal: P2_20/SLCD_31, slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down,
    pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: T6, peripheral: AON__SGLCD0_AON, signal: 'P, 39', pin_signal: P2_21/TRIG_IN14/LPSPI0_PCS1/LPI2C1_SCL/TRIG_OUT4/CT2_MAT0/SLCD_39/ACMP0_IN1, slew_rate: fast,
    open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low, input_buffer: enable,
    invert_input: normal}
  - {pin_num: K3, peripheral: AON__SGLCD0_AON, signal: 'P, 50', pin_signal: P2_4/TRIG_IN8/LPI2C1_SCL/LPSPI0_PCS1/UTICK_CAP0/TRIG_OUT0/ACMP0_OUT/SLCD_50, slew_rate: fast,
    open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low, input_buffer: enable,
    invert_input: normal}
  - {pin_num: K1, peripheral: AON__SGLCD0_AON, signal: 'P, 51', pin_signal: P2_5/TRIG_IN9/LPI2C1_SDA/LPUART1_RXD/UTICK_CAP1/TRIG_OUT1/CT2_MAT0/SLCD_51/WUU_P13, slew_rate: fast,
    open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low, input_buffer: enable,
    invert_input: normal}
  - {pin_num: T2, peripheral: AON__SGLCD0_AON, signal: 'P, 55', pin_signal: P2_16/TRIG_IN6/LPI2C1_SDA/LPUART0_CTS_B/SLCD_55/WUU_P19/ACMP0_IN2, slew_rate: fast, open_drain: disable,
    drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low, input_buffer: enable, invert_input: normal}
  - {pin_num: P17, peripheral: AON__SGLCD0_AON, signal: 'P, 1', pin_signal: P3_14/TRIG_OUT2/LPUART0_RXD/LPI2C1_HREQ/LPUART1_CTS_B/SLCD_1/WUU_P27, slew_rate: fast,
    open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: T14, peripheral: AON__SGLCD0_AON, signal: 'P, 41', pin_signal: P3_5/TRIG_IN7/LPUART1_TXD/SLCD_41, slew_rate: fast, open_drain: disable, drive_strength: low,
    pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: T15, peripheral: AON__SGLCD0_AON, signal: 'P, 33', pin_signal: P3_6/TRIG_IN8/LPUART1_RTS_B/SLCD_33, slew_rate: fast, open_drain: disable, drive_strength: low,
    pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: T16, peripheral: AON__SGLCD0_AON, signal: 'P, 34', pin_signal: P3_7/TRIG_IN9/LPUART1_CTS_B/SLCD_34/WUU_P24, slew_rate: fast, open_drain: disable, drive_strength: low,
    pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: P14, peripheral: AON__SGLCD0_AON, signal: 'P, 38', pin_signal: P3_15/TRIG_OUT3/LPUART0_TXD/LPUART1_RTS_B/SLCD_38, slew_rate: fast, open_drain: disable,
    drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: C8, peripheral: AON__SGLCD0_AON, signal: 'P, 46', pin_signal: P1_0/TRIG_IN13/LPI2C1_SCL/TRIG_OUT0/CT2_MAT0/SLCD_46, slew_rate: fast, open_drain: disable,
    drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low, input_buffer: enable, invert_input: normal}
  - {pin_num: T1, peripheral: AON__SGLCD0_AON, signal: 'P, 53', pin_signal: P2_13/TRIG_IN1/LPI2C0_SDA/LPSPI0_SDI/LPUART1_CTS_B/TRIG_OUT3/CT1_MAT3/SLCD_53/WUU_P16,
    slew_rate: fast, open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low,
    input_buffer: enable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

