nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxl255/common/pin_mux/cm33/pin_mux.c
    const port_pin_config_t port3_6_pinT15_config = {/* Internal pull-up/down resistor is disabled */
                                                     kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     kPORT_LowDriveStrength,
                                                     /* Normal drive strength is configured */
                                                     kPORT_NormalDriveStrength,
                                                     /* Pin is configured as SLCD_33 */
                                                     kPORT_MuxAlt7,
                                                     /* Digital input enabled */
                                                     kPORT_InputBufferEnable,
                                                     /* Digital input is not inverted */
                                                     kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     kPORT_UnlockRegister};
    /* PORT3_6 (pin T15) is configured as SLCD_33 */
    PORT_SetPinConfig(PORT3, 6U, &port3_6_pinT15_config);

    const port_pin_config_t port3_7_pinT16_config = {/* Internal pull-up/down resistor is disabled */
                                                     kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     kPORT_LowDriveStrength,
                                                     /* Normal drive strength is configured */
                                                     kPORT_NormalDriveStrength,
                                                     /* Pin is configured as SLCD_34 */
                                                     kPORT_MuxAlt7,
                                                     /* Digital input enabled */
                                                     kPORT_InputBufferEnable,
                                                     /* Digital input is not inverted */
                                                     kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     kPORT_UnlockRegister};
    /* PORT3_7 (pin T16) is configured as SLCD_34 */
    PORT_SetPinConfig(PORT3, 7U, &port3_7_pinT16_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitKPPPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: A12, peripheral: AON__KPP0, signal: 'kpp_row, 1', pin_signal: P0_13/AONTRIG_IN5/AON_LPI2C0_SDA/KPP_ROW_1/LPTMR0_ALT3/QTMR1_OUT1/LPACMP_OUT/LCSensePushPullALT0_CH1/LCSenseTristateALT0_CH1/KPP_ROW_5/AON_LPADC0_A3,
    slew_rate: fast, open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: up, pull_enable: enable, passive_filter: disable, pull_value: low,
    input_buffer: enable, invert_input: normal}
  - {pin_num: C14, peripheral: AON__KPP0, signal: 'kpp_row, 0', pin_signal: P0_12/AONTRIG_IN4/AON_LPI2C0_SCL/KPP_ROW_0/LPTMR0_ALT2/QTMR1_OUT0/LPACMP_OUT/LCSensePushPullALT0_CH2/LCSenseTristateALT0_CH2/KPP_ROW_4/AON_ACMP0_IN4/AON_LPADC0_A0,
    slew_rate: fast, open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: up, pull_enable: enable, passive_filter: disable, pull_value: low,
    input_buffer: enable, invert_input: normal}
  - {pin_num: F17, peripheral: AON__KPP0, signal: 'kpp_col, 1', pin_signal: P0_3/AONTRIG_IN1/AON_LPI2C0_SDA/KPP_COL_1/LPTMR0_ALT1/QTMR0_OUT3/LCSenseCMP_CH2/AON_LPACMP_IN_2/AON_ACMP0_IN2,
    slew_rate: fast, open_drain: enable, drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low,
    input_buffer: enable, invert_input: normal}
  - {pin_num: F16, peripheral: AON__KPP0, signal: 'kpp_col, 0', pin_signal: P0_2/AONTRIG_IN0/AON_LPI2C0_SCL/KPP_COL_0/LPTMR0_ALT2/QTMR0_OUT2/LCSenseCMP_CH1/AON_LPACMP_IN_1/AON_ACMP0_IN1,
    slew_rate: fast, open_drain: enable, drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low,
    input_buffer: enable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

