nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxl255/common/pin_mux/cm33/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCtimerMatch1Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitCtimerMatch1Pins(void)
{
    /* Clock gate control PORT1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT1);
    /* CTIMER1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kCTIMER1_RST_SHIFT_RSTn);
    /* GPIO1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO1_RST_SHIFT_RSTn);
    /* PORT1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT1_RST_SHIFT_RSTn);

    const port_pin_config_t port1_16_pinD3_config = {/* Internal pull-up/down resistor is disabled */
                                                     kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     kPORT_LowDriveStrength,
                                                     /* Normal drive strength is configured */
                                                     kPORT_NormalDriveStrength,
                                                     /* Pin is configured as CT1_MAT1 */
                                                     kPORT_MuxAlt6,
                                                     /* Digital input enabled */
                                                     kPORT_InputBufferEnable,
                                                     /* Digital input is not inverted */
                                                     kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     kPORT_UnlockRegister};
    /* PORT1_16 (pin D3) is configured as CT1_MAT1 */
    PORT_SetPinConfig(PORT1, 16U, &port1_16_pinD3_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitCtimerPwmPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: U1, peripheral: CTIMER2, signal: 'MATCH, 0', pin_signal: P2_14/TRIG_IN2/LPI2C0_HREQ/LPSPI0_PCS0/TRIG_OUT4/CT2_MAT0/SLCD_27/WUU_P17/HSADC0_A11, slew_rate: fast,
    open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: T4, peripheral: GPIO2, signal: 'GPIO, 18', pin_signal: P2_18/TRIG_IN4/LPI2C0_SDAS/LPUART0_TXD/TRIG_OUT6/CT2_MAT2/SLCD_29/HSADC0_A9, direction: INPUT,
    gpio_per_interrupt: kGPIO_InterruptStatusFlagDisabled, gpio_per_interrupt_sel: kGPIO_InterruptOutput0, slew_rate: fast, open_drain: disable, drive_strength: low,
    pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCtimerPwmPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitCtimerPwmPins(void)
{
    /* Clock gate control PORT2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT2);
    /* Clock gate control GPIO2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO2);
    /* CTIMER2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kCTIMER2_RST_SHIFT_RSTn);
    /* PORT2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT2_RST_SHIFT_RSTn);
    /* GPIO2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO2_RST_SHIFT_RSTn);

    const port_pin_config_t port2_14_pinU1_config = {/* Internal pull-up/down resistor is disabled */
                                                     kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     kPORT_LowDriveStrength,
                                                     /* Normal drive strength is configured */
                                                     kPORT_NormalDriveStrength,
                                                     /* Pin is configured as CT2_MAT0 */
                                                     kPORT_MuxAlt6,
                                                     /* Digital input enabled */
                                                     kPORT_InputBufferEnable,
                                                     /* Digital input is not inverted */
                                                     kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     kPORT_UnlockRegister};
    /* PORT2_14 (pin U1) is configured as CT2_MAT0 */
    PORT_SetPinConfig(PORT2, 14U, &port2_14_pinU1_config);

    const port_pin_config_t port2_18_pinT4_config = {/* Internal pull-up/down resistor is disabled */
                                                     kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     kPORT_LowDriveStrength,
                                                     /* Normal drive strength is configured */
                                                     kPORT_NormalDriveStrength,
                                                     /* Pin is configured as P2_18 */
                                                     kPORT_MuxAlt0,
                                                     /* Digital input enabled */
                                                     kPORT_InputBufferEnable,
                                                     /* Digital input is not inverted */
                                                     kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     kPORT_UnlockRegister};
    /* PORT2_18 (pin T4) is configured as P2_18 */
    PORT_SetPinConfig(PORT2, 18U, &port2_18_pinT4_config);

    gpio_pin_config_t gpio2_pinT4_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin P2_18 (pin T4)  */
    GPIO_PinInit(GPIO2, 18U, &gpio2_pinT4_config);

    /* Interrupt configuration on GPIO2_18 (pin T4): Interrupt/DMA request is disabled */
    GPIO_SetPinInterruptChannel(GPIO2, 18U, kGPIO_InterruptOutput0);
    GPIO_SetPinInterruptConfig(GPIO2, 18U, kGPIO_InterruptStatusFlagDisabled);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFREQMEPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: H2, peripheral: FREQME0, signal: 'IN, 0', pin_signal: P2_0/FREQME_CLK_IN0/LPUART0_RXD/LPSPI0_SDO/TRIG_IN13/CT1_MAT0/SLCD_17/WUU_P11/HSADC0_A16, slew_rate: fast,
    open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: H1, peripheral: FREQME0, signal: 'IN, 1', pin_signal: P2_1/FREQME_CLK_IN1/LPUART0_TXD/LPSPI0_SCK/TRIG_IN14/CT1_MAT1/SLCD_18/HSADC0_A15, slew_rate: fast,
    open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

